Revit 2025 API
MEPSystemClassification Enumeration
 This enumeration is used to classify MEP connectors and systems and drives certain behavior for a particular system type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum MEPSystemClassification
Public Enumeration MEPSystemClassification
public enum class MEPSystemClassification
type MEPSystemClassification
Members
Member name | Value | Description
UndefinedSystemClassification | 0 |  A system classification not yet defined
SupplyAir | 1 |  A supply air duct system
ReturnAir | 2 |  A return air duct system
ExhaustAir | 3 |  Obsolete classification not used anymore
OtherAir | 4 |  An user classified air duct system
DataCircuit | 5 |  An electrical data circuit
PowerCircuit | 6 |  An electrical circuit
SupplyHydronic | 7 |  A hydronic supply piping system
ReturnHydronic | 8 |  A hydronic return piping system
Telephone | 9 |  An electrical circuit classified as telephone
Security | 10 |  An electrical security circuit
FireAlarm | 11 |  An electrical fire alarm circuit
NurseCall | 12 |  An electrical circuit classified as nurse call
Controls | 13 |  An electrical circuit classified as controls
Communication | 14 |  An electrical circuit classified as communication
CondensateDrain | 15 |  Reserved for future use
Sanitary | 16 |  A sanitary piping system
Vent | 17 |  A piping ventilation system
Storm | 18 |  Reserved for future use
DomesticHotWater | 19 |  A hot water piping system
DomesticColdWater | 20 |  A cold water piping system
Recirculation | 21 |  Reserved for future use
OtherPipe | 22 |  An user classified piping system
FireProtectWet | 23 |  A wet fire protection system
FireProtectDry | 24 |  A dry fire protection system
FireProtectPreaction | 25 |  A preaction fire protection system
FireProtectOther | 26 |  A user defined fire protection system
SwitchTopology | 27 |  An electrical switch system
Fitting | 28 |  Reserved for application usage, used for UI filtering in Family Editor
Global | 29 |  Reserved for application usage, used for UI filtering in Family Editor
PowerBalanced | 30 |  Equivalent with PowerCircuit
PowerUnBalanced | 31 |  Equivalent with PowerCircuit
CableTrayConduit | 32 |  Indicates the default type for cable trays and conduits
See Also
Reference
Autodesk.Revit.DB Namespace